foretheWind/stm32_libraries/STM32F37x_I2C_CPAL_Driver/src/stm32f37x_i2c_cpal_dma.c
	/* Enable automatic end mode */
	CR2_tmp |= I2C_CR2_AUTOEND;

	/* If number of data is equal or lower than 255 bytes */
	if (pDevInitStruct->pCPAL_TransferRx->wNumData <= 0xFF )
	{
		/* Update Num_Data */
		Num_Data = pDevInitStruct->pCPAL_TransferRx->wNumData;

		/* Set Nbytes to wNumData */
		CR2_tmp |= (uint32_t)((uint32_t)(Num_Data) << 16);

		/* Disable reload */
		CR2_tmp &= ~I2C_CR2_RELOAD;
	}
	/* If number of data is greater than 255 bytes */
	else
	{
		/* Set Nbytes to wNumData */
		CR2_tmp |= (uint32_t)((uint32_t)(255) << 16);

		/* Enaable reload */
		CR2_tmp |= I2C_CR2_RELOAD;
	}

	/* Generate start */
	CR2_tmp |= I2C_CR2_START;
      
	/* Enable RX DMA request */
	__CPAL_I2C_HAL_ENABLE_RXDMAREQ(pDevInitStruct->CPAL_Dev);

	/* Update CR2 Register */
	__CPAL_I2C_HAL_CR2_UPDATE(pDevInitStruct->CPAL_Dev, CR2_tmp);

	/* Enable master interrupt */
	__CPAL_I2C_HAL_ENABLE_MASTER_IT(pDevInitStruct->CPAL_Dev);

  }
  return CPAL_PASS;
}

/*================== CPAL_I2C_Interrupt_Handler ==================*/

/**
  * @brief  This function handles I2C interrupt request for preparing communication
  *         and for transfer phase in case of using Interrupt Programming Model.
  * @param  pDevInitStruct: Pointer to the peripheral configuration structure.
  * @retval CPAL_PASS. 
  */
uint32_t CPAL_I2C_EV_IRQHandler( CPAL_InitTypeDef* pDevInitStruct)
{
	__IO uint32_t I2CFlagStatus = 0x00000000;

	/* Read I2C status registers (ISR) */
	I2CFlagStatus = __CPAL_I2C_HAL_GET_EVENT(pDevInitStruct->CPAL_Dev);

	/*----------------------------------------*/
	/*-------------- If TCR event ------------*/
	if ((I2CFlagStatus & CPAL_I2C_EVT_TCR) != 0)
	{
		I2C_MASTER_TCR_Handle(pDevInitStruct);
	}

	/*----------------------------------------*/
	/*------------- If TC event --------------*/
	if ((I2CFlagStatus & CPAL_I2C_EVT_TC ) != 0)
	{
		I2C_MASTER_TC_Handle(pDevInitStruct);
	}

	/*----------------------------------------*/
	/*------------- If STOP event ------------*/
	if ((I2CFlagStatus & CPAL_I2C_EVT_STOP) != 0)
	{
		I2C_MASTER_STOP_Handle(pDevInitStruct);
	}

	/*----------------------------------------*/
	/*------------- If NACK event ------------*/
	if((I2CFlagStatus & CPAL_I2C_EVT_NACK ) != 0)
	{
		I2C_MASTER_NACK_Handle(pDevInitStruct);
	}

  return CPAL_PASS;
}


/**
  * @brief  Allows to handle errors occurred during initialization or communication
  *         in order to recover the correct communication status or call specific
  *         user functions.
  * @param  pDevInitStruct: Pointer to the peripheral configuration structure.
  * @retval CPAL_PASS. 
  */
uint32_t CPAL_I2C_ER_IRQHandler(CPAL_InitTypeDef* pDevInitStruct)
{
  /* Read error register and affect to wCPAL_DevError */
  pDevInitStruct->wCPAL_DevError = __CPAL_I2C_HAL_GET_ERROR(pDevInitStruct->CPAL_Dev);

  /* Set CPAL_State to CPAL_STATE_ERROR */
  pDevInitStruct->CPAL_State = CPAL_STATE_ERROR;

  /* If Bus error occurred ---------------------------------------------------*/
  if ((pDevInitStruct->wCPAL_DevError & CPAL_I2C_ERR_BERR) != 0)
  {
    /* Clear error flag */
    __CPAL_I2C_HAL_CLEAR_BERR(pDevInitStruct->CPAL_Dev);

  }

  /* If Arbitration Loss error occurred --------------------------------------*/
  if ((pDevInitStruct->wCPAL_DevError & CPAL_I2C_ERR_ARLO) != 0)
  {
    /* Clear error flag */
    __CPAL_I2C_HAL_CLEAR_ARLO(pDevInitStruct->CPAL_Dev);

  }

  /* If Overrun error occurred -----------------------------------------------*/
  if ((pDevInitStruct->wCPAL_DevError & CPAL_I2C_ERR_OVR) != 0)
  {
    /* No I2C software reset is performed here in order to allow user to get back
    the last data received correctly */
    /* Clear error flag */
    __CPAL_I2C_HAL_CLEAR_OVR(pDevInitStruct->CPAL_Dev);
  }

  return CPAL_PASS;
}

/**
  * @brief  Handle I2C DMA TX interrupt request when DMA programming Model is
  *         used for data transmission. 
  * @param  pDevInitStruct: Pointer to the peripheral configuration structure.
  * @retval CPAL_PASS.
  */
uint32_t CPAL_I2C_DMA_TX_IRQHandler(CPAL_InitTypeDef* pDevInitStruct)
{
  /* Reinitialize timeout value to default (no timeout initiated) */
  pDevInitStruct->wCPAL_Timeout = CPAL_I2C_TIMEOUT_DEFAULT;

  /*------------- If TC interrupt ------------*/
  if((__CPAL_I2C_HAL_GET_DMATX_TCIT(pDevInitStruct->CPAL_Dev)) != 0)
  {
      /* Update remaining number of data */
      pDevInitStruct->pCPAL_TransferTx->wNumData = 0;

      /* Call DMA TX TC UserCallback */
      CPAL_I2C_DMATXTC_UserCallback(pDevInitStruct);

      /* Disable DMA request and channel */
      __CPAL_I2C_HAL_DISABLE_TXDMAREQ(pDevInitStruct->CPAL_Dev);
      __CPAL_I2C_HAL_DISABLE_DMATX(pDevInitStruct->CPAL_Dev);

  }

  /* Clear DMA interrupt Flag */
  __CPAL_I2C_HAL_CLEAR_DMATX_IT(pDevInitStruct->CPAL_Dev);

  return CPAL_PASS;
}


/**
  * @brief  Handle I2C DMA RX interrupt request when DMA programming Model is
  *         used for data reception.  
  * @param  pDevInitStruct: Pointer to the peripheral configuration structure.
  * @retval CPAL_PASS. 
  */
uint32_t CPAL_I2C_DMA_RX_IRQHandler(CPAL_InitTypeDef* pDevInitStruct)
{
  /* Reinitialize Timeout Value to default (no timeout initiated) */
  pDevInitStruct->wCPAL_Timeout = CPAL_I2C_TIMEOUT_DEFAULT; 

  /*------------- If TC interrupt ------------*/
  if ((__CPAL_I2C_HAL_GET_DMARX_TCIT(pDevInitStruct->CPAL_Dev)) != 0)
  {
      /* Update remaining number of data */
      pDevInitStruct->pCPAL_TransferRx->wNumData = 0;

      /* Disable DMA Request and Channel */
      __CPAL_I2C_HAL_DISABLE_RXDMAREQ(pDevInitStruct->CPAL_Dev);
      __CPAL_I2C_HAL_DISABLE_DMARX(pDevInitStruct->CPAL_Dev);

      /* Call DMA RX TC UserCallback */
      CPAL_I2C_DMARXTC_UserCallback(pDevInitStruct);
  }

  /* Clear DMA interrupt Flag */
  __CPAL_I2C_HAL_CLEAR_DMARX_IT(pDevInitStruct->CPAL_Dev);

  return CPAL_PASS;
}

